# Задание 1  ---- 

# Устанавливаем параметры

n <- 2100 # Количество наблюдений
theta <- c(-0.3, 0.4) # Параметры AR(2)
A <- c(1, 0.2, 0.1, 0.2) # Параметры ARCH(3)

# Генерируем последовательность независимых нормальных случайных величин
epsilon <- rnorm(n)

# Создаем векторы для хранения значений
x <- rep(0, n)
sigma2 <- rep(0, n)

# Инициализируем начальные значения для sigma^2
sigma2[1:3] <- var(epsilon) # Первые значения дисперсии
x[1:3] <- rnorm(3) # Первые значения ряда x

# Генерируем процесс AR(2)ARCH(3)
for (i in 4:n) {
  # Вычисляем sigma^2
  sigma2[i] <- A[1] + A[2] * x[i-1]^2 + A[3] * x[i-2]^2 + A[4] * x[i-3]^2
  # Генерируем x по AR(2) с учетом дисперсии sigma^2
  x[i] <- theta[1] * x[i-1] + theta[2] * x[i-2] + sqrt(sigma2[i]) * epsilon[i]
}

# Построение графика
plot(x, type = "l", col = "blue", main = "AR(2)ARCH(3) процесс", xlab = "Время", ylab = "x_n")
